; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v5 - type_2 ?v7 - type_1)
 	      (pred_2 ?v4 - object ?v7 - type_1)
	      (pred_4 ?v5 - type_2 ?v8 - type_3)
	      (pred_3 ?v5 - type_2 ?v4 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v5 - type_2 ?v1 ?v6 - type_1)
       :precondition (and  (pred_1 ?v5 ?v1))
       :effect (and  (pred_1 ?v5 ?v6)
		     (not (pred_1 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_2 ?v3 - object ?v2 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v2) (pred_1 ?v5 ?v2) (pred_4 ?v5 ?v8))
       :effect (and (pred_3 ?v5 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v2)) 
		    (not (pred_4 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_2 ?v3 - object ?v2 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v3 ?v8) (pred_1 ?v5 ?v2))
       :effect (and (pred_2 ?v3 ?v2)
		    (pred_4 ?v5 ?v8)
		    (not (pred_3 ?v5 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_04 - type_2
obj_01 obj_03 obj_13 obj_05 - type_3
obj_06 obj_07 obj_10 obj_08 - type_1
obj_09 obj_12 obj_14 obj_11 - object)
(:init
(pred_1 obj_02 obj_10)
(pred_4 obj_02 obj_01)
(pred_4 obj_02 obj_03)
(pred_1 obj_04 obj_06)
(pred_4 obj_04 obj_13)
(pred_4 obj_04 obj_05)
(pred_2 obj_09 obj_06)
(pred_2 obj_12 obj_10)
(pred_2 obj_14 obj_08)
(pred_2 obj_11 obj_07)
)
(:goal
(and
(pred_2 obj_09 obj_06)
(pred_2 obj_12 obj_07)
(pred_2 obj_14 obj_10)
(pred_2 obj_11 obj_08)
)
)

(:constraints
  (always (not (pred_1 obj_02 obj_07)))
)
)

; plan
1. (op_2 obj_02 obj_12 obj_10 obj_03)
   deleted: (pred_2 obj_12 obj_10) (pred_4 obj_02 obj_03)
   added: (pred_3 obj_02 obj_12 obj_03)
   goals met: 1 of 4
2. (op_3 obj_04 obj_06 obj_07)
   deleted: (pred_1 obj_04 obj_06)
   added: (pred_1 obj_04 obj_07)
   goals met: 1 of 4
3. (op_2 obj_04 obj_11 obj_07 obj_05)
   deleted: (pred_2 obj_11 obj_07) (pred_4 obj_04 obj_05)
   added: (pred_3 obj_04 obj_11 obj_05)
   goals met: 1 of 4
4. (op_3 obj_04 obj_07 obj_08)
   deleted: (pred_1 obj_04 obj_07)
   added: (pred_1 obj_04 obj_08)
   goals met: 1 of 4
5. (op_1 obj_04 obj_11 obj_08 obj_05)
   deleted: (pred_3 obj_04 obj_11 obj_05)
   added: (pred_2 obj_11 obj_08) (pred_4 obj_04 obj_05)
   goals met: 2 of 4
6. (op_2 obj_04 obj_14 obj_08 obj_05)
   deleted: (pred_2 obj_14 obj_08) (pred_4 obj_04 obj_05)
   added: (pred_3 obj_04 obj_14 obj_05)
   goals met: 2 of 4
7. (op_3 obj_04 obj_08 obj_10)
   deleted: (pred_1 obj_04 obj_08)
   added: (pred_1 obj_04 obj_10)
   goals met: 2 of 4
8. (op_1 obj_04 obj_14 obj_10 obj_05)
   deleted: (pred_3 obj_04 obj_14 obj_05)
   added: (pred_2 obj_14 obj_10) (pred_4 obj_04 obj_05)
   goals met: 3 of 4
9. (op_1 obj_02 obj_12 obj_10 obj_03)
   deleted: (pred_3 obj_02 obj_12 obj_03)
   added: (pred_2 obj_12 obj_10) (pred_4 obj_02 obj_03)
   goals met: 3 of 4
10. (op_2 obj_04 obj_12 obj_10 obj_05)
   deleted: (pred_2 obj_12 obj_10) (pred_4 obj_04 obj_05)
   added: (pred_3 obj_04 obj_12 obj_05)
   goals met: 3 of 4
11. (op_3 obj_04 obj_10 obj_07)
   deleted: (pred_1 obj_04 obj_10)
   added: (pred_1 obj_04 obj_07)
   goals met: 3 of 4
12. (op_1 obj_04 obj_12 obj_07 obj_05)
   deleted: (pred_3 obj_04 obj_12 obj_05)
   added: (pred_2 obj_12 obj_07) (pred_4 obj_04 obj_05)
   goals met: 4 of 4
